package ready;

import java.util.Scanner;

/*
Minimum of Three
Problem #5 

 *Даны несколько троек чисел. Требуется выбрать наименьшее в каждой тройке.

Входные данные - первая строка указывает количество троек чисел.
Каждая из следующих строк содержит одну такую тройку.
Ответ должен содержать выбранные из каждой тройки минимумы, по порядку, через пробел.

Пример:

входные данные:
3
7 3 5
15 20 40
300 550 137

ответ:
3 15 137
 */
/**
 *
 * @author vvm
 */
public class MinimumOfThree {

    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        System.out.println("Number of lines :");

        int numOfLines = in.nextInt();
        int[] minsOfTree = new int[numOfLines];

        for (int i = 0; i < minsOfTree.length; i++) {
            int q, w, e;
            q = in.nextInt();
            w = in.nextInt();
            e = in.nextInt();
            //  System.out.println("q= "+q+" w= "+w+" e="+e);

            if ((q < w) && (q < e)) {
                //System.out.println(" ok i ="+i);
                minsOfTree[i] = q;
            }
            if ((w < q) && (w < e)) {
                minsOfTree[i] = w;
            }
            if ((e < q) && (e < w)) {
                minsOfTree[i] = e;
            }

        }
        for (int i = 0; i < minsOfTree.length; i++) {
            System.out.print(minsOfTree[i] + " ");
        }
    }
}

// -5335466 2803104 -7386207 -8288826 -8789335 7933398 -7667565 -5061798 -1051439 -5138708 7474256 -6804039 4696127 6407300 -9801076 -8934952 6878640 -5022148 3926412 -1188275 -1724645 -8329571 -6764848 3194376 3393300 -4286142 -4753367
//-5335466 -2760445 -7386207 -8288826 -8789335 -9133876 -7667565 -5061798 -1051439 -5138708 -5902915 -6804039 -8435277 -5821484 -9801076 -8934952 -1952516 -5022148 3926412 -1188275 -7732899 -8329571 -6764848 -4906269 -8498968 -4286142 -4753367
//-7227119 -8861859 -5577130 -3472089 -954175 -8497433 -7329685 -7077477 -7637262 -3886515 -2273530 1938054 5968844 3946746 -7007429 -5504862 -2710334 -7425504 -5062767 -8356265 -8683196 -8996220 -5466444 -8409159 -5698943 -1504026 -9978530 1762294 -3310411 1092297
//-7227119 -8861859 -5577130 -8911559 -954175 -8497433 -7329685 -7077477 -7637262 -3886515 -2273530 1938054 5968844 -9602587 -7007429 -5504862 -2710334 -7425504 -5062767 -8356265 -8683196 -8996220 -5466444 -8409159 -5698943 -1504026 -9978530 1762294 -9636188 -4698955

//-4030304 -8992000 -8453094 -1653067 -5316640 -3264988 -1184602 -3192213 -1679711 -1898843 -9466132 -8458133 -7931349 -6764940 -9244726 -7850569 205039 -7370115 3674602 -6863545 8568001 -9913757 -8371890 -6517122 -3966401 -5141333
